const descriptions = [
    {
        _id: "123456",
        name: [
            "Внешнее/внутренее покрытие: атмосферостойкое порошково-полимерное «Антик серебро» / царговая МДФ-панель 22 мм, вставки из глянцевого стекла Лакобель",
            "Толщина дверного полотна/короба: 110 мм / 141 мм",
            "Терморазрыв 24 мм: двухкамерный спейсер из ПВХ",
            "Наполнитель: PIR-плита",
            "Уплотнитель: 3 контура вставного уплотнителя из вспененной резины (2 на полотне, 1 на коробе)",
            "Замки сувальдные KALE, IV (наивысший) класс взломостойкости, дополнительная защита от высверливания: две пластины из высоколегированной стали с обеих сторон замка; диаметр ригелей: 16",
            "Замки сувальдные KALE, IV (наивысший) класс взломостойкости, дополнительная защита от высверливания: две пластины из высоколегированной стали с обеих сторон замка; диаметр ригелей: 16"
        ]
    },
    {
        _id: "220229",
        name: [
            "Внешнее/внутренее покрытие: атмосферостойкое порошково-полимерное «Антик серебро» / царговая МДФ-панель 22 мм, вставки из глянцевого стекла Лакобель",
            "Толщина дверного полотна/короба: 110 мм / 141 мм",
            "Терморазрыв 24 мм: двухкамерный спейсер из ПВХ",
            "Наполнитель: PIR-плита",
            "Уплотнитель: 3 контура вставного уплотнителя из вспененной резины (2 на полотне, 1 на коробе)",
            "Замки сувальдные KALE, IV (наивысший) класс взломостойкости, дополнительная защита от высверливания: две пластины из высоколегированной стали с обеих сторон замка; диаметр ригелей: 16",
            "Замки сувальдные KALE, IV (наивысший) класс взломостойкости, дополнительная защита от высверливания: две пластины из высоколегированной стали с обеих сторон замка; диаметр ригелей: 16"
        ]
    },
    {
        _id: "347761",
        name: [
            "Внешнее/внутренее покрытие: атмосферостойкое порошково-полимерное «Антик серебро» / царговая МДФ-панель 22 мм, вставки из глянцевого стекла Лакобель",
            "Толщина дверного полотна/короба: 110 мм / 141 мм",
            "Терморазрыв 24 мм: двухкамерный спейсер из ПВХ",
            "Наполнитель: PIR-плита",
            "Уплотнитель: 3 контура вставного уплотнителя из вспененной резины (2 на полотне, 1 на коробе)",
            "Замки сувальдные KALE, IV (наивысший) класс взломостойкости, дополнительная защита от высверливания: две пластины из высоколегированной стали с обеих сторон замка; диаметр ригелей: 16",
            "Замки сувальдные KALE, IV (наивысший) класс взломостойкости, дополнительная защита от высверливания: две пластины из высоколегированной стали с обеих сторон замка; диаметр ригелей: 16"
        ]
    },
    {
        _id: "843707",
        name: [
            "Ширина, мм ---3500",
            "Класс износостойкости---32",
            "Класс применения---полукоммерческий",
            "Тип основы---вспененная",
            "Толщина, мм---1.8"
        ]
    },
    {
        _id: "772674",
        name: [
            "Ламинат - это многослойное ламинированное покрытие для пола, которое прекрасно подойдет для бытовых и коммерческих помещений. При выборе покрытия для помещений с высокой проходимостью стоит обратить внимание на износостойкий ламинат 32 или 33 класса. Если нужен пол для кухни или коридора рекомендуется влагостойкий ламинат. Широкий ассортимент различных декоров и характеристик позволит выбрать покрытие для любых помещений (детская комната, спальня, зал, гостиная или личный кабинет)."
        ]
    },
    {
        _id: "670374",
        name: [
            "Ламинированный пол (ламинат) Egger Pro Classic 8-33 Aqua Plus EPL111 Дуб Триада четырёхсторонняя фаска, имитация натурального дерева, фактура - Дуб, матовая поверхность. Данный водостойкий товар 33 класса прочности великолепно украсит любой дизайн квартиры или офисного помещения может использоваться для помещений с высокой влажностью."
        ]
    },
    {
        _id: "892077",
        name: [
            "Ламинат - это многослойное ламинированное покрытие для пола, которое прекрасно подойдет для бытовых и коммерческих помещений. При выборе покрытия для помещений с высокой проходимостью стоит обратить внимание на износостойкий ламинат 32 или 33 класса. Если нужен пол для кухни или коридора рекомендуется влагостойкий ламинат. Широкий ассортимент различных декоров и характеристик позволит выбрать покрытие для любых помещений (детская комната, спальня, зал, гостиная или личный кабинет)."
        ]
    },
    {
        _id: "567372",
        name: [
            "Ламинат - это многослойное ламинированное покрытие для пола, которое прекрасно подойдет для бытовых и коммерческих помещений. При выборе покрытия для помещений с высокой проходимостью стоит обратить внимание на износостойкий ламинат 32 или 33 класса. Если нужен пол для кухни или коридора рекомендуется влагостойкий ламинат. Широкий ассортимент различных декоров и характеристик позволит выбрать покрытие для любых помещений (детская комната, спальня, зал, гостиная или личный кабинет)."
        ]
    },
    {
        _id: "116043",
        name: [
            "Ширина, мм — 1060",
            "Вид поверхности — вспененный винил",
            "Влагостойкость — нет",
            "Область применения — Универсальные",
            "Тип основы — флизилин",
            "Марка (бренд) — Палитра"
        ]
    },
    {
        _id: "308722",
        name: [
            "Ширина, мм — 1060",
            "Длина, мм — 10 000",
            "Вид поверхности — вспененный винил",
            "Влагостойкость — нет",
            "Область применения — Универсальные",
            "Тип основы — флизилин",
            "Марка (бренд) — Палитра"
        ]
    },
    {
        _id: "609383",
        name: ["Марка (бренд) — TDM", "Страна происхождения — РОССИЯ"]
    },
    {
        _id: "748684",
        name: ["Марка (бренд) — PARADYZ", "Страна происхождения — ПОЛЬША"]
    },
    {
        _id: "284503",
        name: ["Марка (бренд) — PARADYZ", "Страна происхождения — ПОЛЬША"]
    },
    {
        _id: "599264",
        name: [
            "Р – наименование строительного материала (рубероид с основой из картона)",
            "К – назначение (кровельный)",
            "П – тип присыпки (пылеобразная)",
            "350 – показатель плотности картонной основы (0,35 г/м²)"
        ]
    },
    {
        _id: "206631",
        name: [
            "Стеклоизол – это гидроизоляционный и кровельный материал нового поколения, потомок рубероида, превышающий предшественника по техническим и эксплуатационным показателям. Основу стеклоизола ХКП составляет стеклохолст, на который наносят битумное вяжущее с двух сторон. Верхнюю и нижнюю поверхности покрывают защитными слоями разного типа в зависимости от разновидности материала",
            "Стеклоизол ХКП – полотно для покрытия кровельного пирога (П). Основа – холст из стекловолокна (Х), в качестве покрытия используется мелкая крошка (К). Именно зернистый материал обеспечивает устойчивость пластичного полимера к внешним воздействиям – перепадам температур, ультрафиолету и чрезмерному нагреву до высоких температур.У полотен ХКП нижний слой – наплавляемая пленка"
        ]
    },
    {
        _id: "192346",
        name: [
            "Сухая штукатурная смесь на основе гипса с полимерными добавками, обеспечивающими повышенную адгезию",
            "Предназначена для высококачественного оштукатуривания потолков и стен с обычным твердым основанием, например, таких как бетон, кирпич, цементная штукатурка, а так же поверхностей из пенополистирола, ЦСП",
            "Особенно рекомендуется для гладких бетонных потолочных и стеновых поверхностей.Можно использовать для отделки помещений с нормальной влажностью, а также в кухнях и ванных",
            "Наносится вручную"
        ]
    },
    {
        _id: "161310",
        name: [
            "Состав: комплексное минеральное вяжущее, фракционированный песок, минеральные добавки, модифицирующие полимерные добавки",
            "Характеристика применения:Расход сухой смеси на 1 кв. м при слое 10 мм - 14-16 кг, минимальная толщина слоя - 5 мм, максимальная толщина слоя - 80 мм, сохраняемость готового раствора в открытой таре - 30 мин. Укладка напольных покрытий (в зависимости от типа покрытия) - от 3 суток.Проведение работ при температуре основания - от +5 °С до +25 °С",
            "Прочие характеристики: максимальная фракция песка - до 0,63 мм,максимальная толщина слоя при частичном выравнивании - 90 мм, время полного набора прочности - 28 суток, прочность на изгиб (через 28 суток) - более 2 МПа, прочность сцепления с основанием (через 28 суток) - не менее 0,6 МПа, прочность на сжатие (через 28 суток) - не менее 12,5 МПа (М100), при нормальных условиях твердения (температура окружающей среды 20 С, влажность 60%"
        ]
    },
    {
        _id: "599264",
        name: [
            "Бетонная стяжка «Эталон М300 Пескобетон» предназначен для изготовления прочных бетонных стяжек различной толщины, для заливки фундаментов при обустройстве жилых, общественных и производственных помещений, гаражей, зон повышенного потока людей, при монтажно-кладочных работах, для возведения и ремонта бетонных стен и оснований. Обеспечивает высокое качество строительных работ. «Эталон М300 Пескобетон» рекомендуется для выполнения высококачественного базового несущего слоя полов",
            "Бетонная стяжка «Эталон М300 Пескобетон» предназначен для изготовления прочных бетонных стяжек различной толщины, для заливки фундаментов при обустройстве жилых, общественных и производственных помещений, гаражей, зон повышенного потока людей, при монтажно-кладочных работах, для возведения и ремонта бетонных стен и оснований. Обеспечивает высокое качество строительных работ. «Эталон М300 Пескобетон» рекомендуется для выполнения высококачественного базового несущего слоя полов.",
            "Количество воды на 1 кг сухой смеси, л/кг0,15-0,17, толщина наносимого слоя, мм30-200, температура проведения работ+5 +30, время пригодности к работе при t= 22 C и влажности 60%180, расход при толщине слоя 1 мм1,9 кг/кв.м, время твердения, час24, морозостойкость, циклов50"
        ]
    },
    {
        _id: "328407",
        name: [
            "Специализированный клеевой состав на цементной основе предназначен для кладки наружных и внутренних стен из ячеистого бетона, силикатного кирпича и других материалов с повышенной пористостью при отрицательных температурах",
            "Характеристика применения: расход сухой смеси на 1 кв. м при слое 3 мм* ~ 2,5 кг (*при выполнении работ зубчатым шпателем с размером зуба 6 мм, рекомендуемая толщина слоя 2-3 мм, сохраняемость готового раствора в открытой таре 2 часа, открытое время после нанесения 10 мин, время полного набора прочности 28 суток, проведение работ при температуре от -10 до +15 С"
        ]
    },
    {
        _id: "536937",
        name: [
            "Новый продукт, предназначенный для профессионального домостроения: материал с лучшими теплоизоляционными характеристиками в своем классе, материал с повышенной упругостью и усиленной влагостойкостью, негорючий",
            "Лучшее решение для строительных бригад и частных застройщиков: производится в упаковках удобного размера – 6 кв. м, высота плит – 1 м, теплопроводность λ10 = 0,034 Вт/мК, горючесть: НГ, класс пожарной опасности: КМ0, температура применения, ºС: от -60 до +220, водопоглощение при частичном погружении за 24 часа, кг/м²: не более 1, экологически чистый материал"
        ]
    },
    {
        _id: "536937",
        name: [
            "Энергоизол  лавсан - это теплоизоляционный материал с отражающим покрытием в виде металлизированного лавсана, которое обеспечивает высокое тепловое сопротивление излучению и позволяет снизить тепловые потери, уменьшить толщину теплоизоляционных конструкций и снизить энергозатраты",
            "Применяется: для утепления стен, потолков, кровли, чердачных, мансардных и подвальных помещений, для изоляции трубопроводов, емкостей и арматуры в системах водоснабжения и отопления, воздуховодов, для отражающей изоляции за радиаторами отопления, для изоляции помещений в банях и саунах, кузовов автомобилей"
        ]
    },
    {
        _id: "715510",
        name: [
            "Экспресс герметизация за 1 час (время образования поверхностной пленки, выдерживающей воздействие воды)",
            "Водостойкий",
            "Высокоэластичный",
            "Содержит противогрибковую добавку"
        ]
    },
    {
        _id: "464164",
        name: [
            "MAKROFLEX представляет собой однокомпонентную полиуретановую монтажную пену, затвердевающую под воздействием влажности воздуха до полуэластичного состояния. Проста в применении. При затвердевании саморасширяющаяся пена увеличивается в объеме примерно в два раза",
            "Makroflex имеет отличную адгезию к дереву, бетону, камню, металлу и т.д. Поверхности, на которые наносится пена, могут быть влажными, но не покрытыми инеем или льдом. Содержимое одного баллона дает до 25-50 литров готовой пены в зависимости от условий применения – температуры, влажности воздуха, возможности свободного расширения и т.д"
        ]
    },
    {
        _id: "331105",
        name: [
            "Момент Монтаж Суперсильный МВп-70 прозрачный обладает высокой начальной силой склеивания (70 кг/м2) и отлично подходит для различных ремонтных работ",
            "Области применения:стиропор, пенопласт, полистирол, дерево, металл, ПВХ, керамика, ДСП, гипсокартон,  пробка, гипс и другие подобные материалы",
            "Не подходит для для полиэтилена, полипропилена, тефлона"
        ]
    },
    {
        _id: "836633",
        name: [
            "Цвет плёнки: прозрачный",
            "Связующее: cополимер акриловый",
            "Расход смеси на 1 м2:~0,1-0,2 л при однократном нанесении",
            "Морозостойкость: не менее 5 циклов",
            "Рекомендуемая температура помещения: не ниже 13 ° С"
        ]
    },
    {
        _id: "299752",
        name: [
            "Краска водно-дисперсионная интерьерная моющаяся глубокоматовая для стен и потолков с нейтральным запахом. Предназначена для окрашивания стен и потолков в помещениях с нормальной и повышенной влажностью. Скрывает мелкие дефекты поверхности. Краска образует влагостойкое, устойчивое к многократному интенсивному мытью с применением бытовых абразивных моющих средств покрытие (3 класс износостойкости к истиранию по стандарту ISO 11998/DIN EN 13300). Легко наносится без разбрызгивания и подтеков. Для внутренних работ. Рекомендуется для детских и лечебно-профилактических учреждениях. Имеет высокую степень белизны.  Для ручного и механизированного нанесения."
        ]
    },
    {
        _id: "523861",
        name: [
            "Точность: 0,5 мм/м",
            "Двутавровый усиленный профиль 3,6 мм",
            "2 колбы",
            "Линейка для проведения разметочных работ",
            "Всепогодная стабильность измерений: от -20° до +40°С.",
            "Диапазон длин: 40-200 см",
            "Гарантия на точность измерений: 2 года",
            "Длина 150 см"
        ]
    },
    {
        _id: "991531",
        name: [
            "Напряжение аккумулятора - 18 В",
            "Частота вращения - 0-450/1550 об/мин",
            "Размер патрона -  0,8-10 мм",
            "Дерево/пластик/металл - 28/16/10 мм",
            "Тип аккумулятора - Li-ion",
            "Емкость аккумулятора - 1,3 Ач",
            "Время заряда  - 1,5 ч",
            "Вес - 1,24 кг",
            "Дополнительная аккумуляторная батарея, быстрая зарядка аккумуляторной батареи, легкий вес аккумуляторной батареи, индикатор степени заряда батареи, двухскоростной планетарный редуктор, регулировка крутящего момента, регулировка частоты вращения, функция сверления, электрический тормоз двигателя, электрический реверс, резиновые вставки, быстрозажимной патрон, металлическая клипса на ремень, эргономичная конструкция"
        ]
    },
    {
        _id: "271623",
        name: [
            "Дрель ударная электрическая ЗУБР ЗДУ-850 ЭРММ2, предназначена для сверления отверстий в различных материалах (дерево, сталь, кирпич, легкий бетон и т. д.) при установке соответствующих сверл. Также возможно использование дрели для заворачивания крепежных изделий (при установке соответствующих бит). Электронная регулировка оборотов в широком диапазоне расширяет возможности использования изделия. Металлический корпус редуктора обеспечивает лучший теплоотвод и увеличивает надежность инструмента благодаря стабильности геометрических размеров. Изменение частоты вращения степенью нажатия на выключатель позволяет плавно начинать сверление без увода сверла и затем продолжать работу на высокой скорости. Шестерни из хромового сплава продлевают срок жизни ударного механизма. Надежное удержание дрели и удобное хранение сменного инструмента благодаря удобной дополнительной рукоятке-пеналу. Функция сверления с ударом позволяет сверлить кирпич и бетон. Надежная конструкция на прецизионных шариковых подшипниках. Фиксация выключателя облегчает длительную работу. Графитовые щетки с увеличенным сроком службы (ресурс не менее 50 ч). Дрель ЗУБР - незаменимый помощник дома. Мощная дрель с металлическим корпусом редуктора, качественным кулачковым патроном, плавной регулировкой оборотов и надежной конструкцией на подшипниках - лучший подарок домашнему мастеру. Функция сверления с ударом, широкий диапазон регулировки частоты вращения, удобная дополнительная рукоятка - все, что нужно для качественной работы"
        ]
    },
    {
        _id: "629745",
        name: [
            "Облегченная модель в линейке ЗУБР с сопоставимыми профессиональным моделям характеристиками для домашнего мастера; - Специально разработанный корпус редуктора для улучшения теплоотвода и обеспечения прочности самого нагруженного узла; - Система плавного пуска позволяет включать мощный двигатель без рывка и пусковой перегрузки; - Пылезащищенные выключатель (степень защиты IP5X) и подшипники - надежная защита основных узлов; - Поворотные голова и основная рукоятка для более комфортной работы даже в сложных условиях; - Удобная блокировка шпинделя; - Фирменная дополнительная рукоятка, устанавливаемая в двух положениях; - Широкий эргономичный выключатель с пылезащитой, блокировкой включения, а также фиксацией во включенном положении; - Самоотключающиеся щетки с легким доступом для замены",
            "Посадочный диаметр:  22,2 мм",
            "Поворотная голова:  есть",
            "Число оборотов:  8000 об/мин"
        ]
    }
];
const getDescription = (id) =>
    new Promise((resolve) => {
        window.setTimeout(function () {
            resolve(descriptions.find((description) => description._id === id));
        }, 1000);
    });
export default {
    getDescription
};
